[{"Name":"C++ UIKit","AnnounceDate":"2020-09-16T00:00:00","ImageURL":"/images/cppukitheader.png","PostURL":"cppuikit","ShortDescription":"A C++ library for making quick and simple console UIs.","Description":"This was a fun project I worked on to help me prototype console tools quicker and allow me to make them look and feel nice. I worked on it from Sept 2020 to Feb 2021. It was made for windows, and while some features might work on other operating systems a few will certainly not, such as the cursor menu.\n\nFull documentation is available as well as a demo application that showcases many of the features. You can find both of those things on the Github Repo.\n","Tags":["Library","C++","Console","Windows"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/UIKit"}]},{"Name":"Epsi's Den","AnnounceDate":"2024-12-16T00:00:00","ImageURL":"/images/aboutbanner.png","PostURL":"DenWebsite","ShortDescription":"The website you're on right now!","Description":"This is the all new version of my website, V3, with custom styling and C# backend tools for making post and project pages from markdown. I've also massively redone my Music Recommendations page to showcase my recommendations better, with better links to listen to them, and more backend tools in C# to quickly add and manage recommendations.\n\nThere are also some easter eggs to find, like a hidden page. \n","Tags":["HTML","CSS","JS","C#"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/EpsiRho.github.io"}]},{"Name":"Discord Data Package Explorer","AnnounceDate":"2022-04-20T00:00:00","ImageURL":"/images/discorddpeheader.png","PostURL":"discorddpe","ShortDescription":"A simple way to view the data inside your discord data package.","Description":"This is a small little application to view the information stored in a Discord Data Package. This is to help users easily explore the data discord has on them, as it can be hard for normal users to comb through large text and json files.\n\nYou can find the code and application downloads on GitHub\n\nUpdate: Pushed v1.0.1 to fix an odd COM related crash in newer Win11 versions.\n","Tags":["WASDK","Windows","C#","Discord"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/Discord-Data-Package-Explorer"}]},{"Name":"E621 C# Library","AnnounceDate":"2021-03-19T00:00:00","ImageURL":"/images/e6apiheader.png","PostURL":"e6api","ShortDescription":"A wrapper around many of the e621.net api endpoints.","Description":"This was made while I was learning REST API development for the first time. I picked the e621 API for the funny and because it’s auth and rate-limits were relaxed and easy to start with. This later went on to be used in Fluff, which was my first attempt at a good looking UI application. I hosted it on nuget to make it easier to use in my projects, and for some reason it has 11k+ downloads xP\n\nYou can find the code on GitHub and the built library on nuget. Documentation for this is incomplete and I’ll likely not revisit it!\n","Tags":["Library","C#","NSFW"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/E621-C-Sharp-Api-Wrapper"},{"Name":"Nuget","Link":"https://www.nuget.org/packages/e6API_EpsiRho"}]},{"Name":"Fluff","AnnounceDate":"2022-02-13T00:00:00","ImageURL":"/images/fluffprojheader.png","PostURL":"fluff","ShortDescription":"An e621.net client for Windows 10/11","Description":"A beautiful, native windows app for e926/e621! View, search, and download posts submitted by other users, and submit your own.\n\nThis was a fun project I used to deep dive into learning UWP and making better UIs. It got pretty far along, but I’ll likely no longer be updating it. It does still mostly work despite a few bugs, I may go fix them at some point but I don’t plan to. I’m pretty proud of the result, especially the custom control behavior I made for the upload page.\n\nIf you want to check this out, it’s available on GitHub and the Microsoft Store. Don’t worry, it starts in safe mode! You have to enable NSFW content in the settings if that’s what you’re looking for :P\n","Tags":["UWP","Windows","C#","NSFW","Furry"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/Fluff"},{"Name":"Microsoft Store","Link":"https://apps.microsoft.com/detail/9NJRHG6FVKL9?rtc=1&hl=en-us&gl=US"}]},{"Name":"Horizon File Transfer","AnnounceDate":"2020-12-28T00:00:00","ImageURL":"/images/hrznftpheader.png","PostURL":"horizonftp","ShortDescription":"A UWP app for transferring files PTP.","Description":"This was the first real app I developed. I started the project because at the time, Discord’s upload limit was 8mb and that was never enough to send files to my friends. So I created horizon to give me infinite upload limit and allow easy transfers to my contacts.\n","Tags":["UWP","C#","Windows"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/Horizon?tab=readme-ov-file"},{"Name":"Microsoft Store","Link":"https://apps.microsoft.com/detail/9NLF1LS7Q6J6?hl=en-US&gl=US"}]},{"Name":"Wordle Offline","AnnounceDate":"2022-01-09T00:00:00","ImageURL":"/images/wordleofflineheader.png","PostURL":"wordleoffline","ShortDescription":"A recreation of Wordle in WASDK.","Description":"I made this project cause I was having fun with wordle and wanted to play more than once a day. It’s pretty simple, works the same as the Wordle website does.\n","Tags":["WASDK","Windows","C#","Games"],"Links":[{"Name":"Github","Link":"https://github.com/EpsiRho/Wordle-Offline"}]}]